OpenFoam2/circular-cylinder240/system/blockMeshDictTest
//Ben Juenger
//COE347 OF2

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
  (0.500000000000000 0.000000000000000 -0.050000000000000) // 0
  (0.353553390593274 0.353553390593274 -0.050000000000000) // 1
  (0.000000000000000 0.500000000000000 -0.050000000000000) // 2
  (-0.353553390593274 0.353553390593274 -0.050000000000000) // 3
  (-0.500000000000000 0.000000000000000 -0.050000000000000) // 4
  (-0.353553390593274 -0.353553390593274 -0.050000000000000) // 5
  (0.000000000000000 -0.500000000000000 -0.050000000000000) // 6
  (0.353553390593274 -0.353553390593274 -0.050000000000000) // 7
  (1.000000000000000 0.000000000000000 -0.050000000000000) // 8
  (0.707106781186548 0.707106781186547 -0.050000000000000) // 9
  (0.000000000000000 1.000000000000000 -0.050000000000000) // 10
  (-0.707106781186547 0.707106781186548 -0.050000000000000) // 11
  (-1.000000000000000 0.000000000000000 -0.050000000000000) // 12
  (-0.707106781186548 -0.707106781186547 -0.050000000000000) // 13
  (0.000000000000000 -1.000000000000000 -0.050000000000000) // 14
  (0.707106781186547 -0.707106781186548 -0.050000000000000) // 15
  (6.000000000000000 0.000000000000000 -0.050000000000000) // 16
  (6.000000000000000 0.707106781186547 -0.050000000000000) // 17
  (6.000000000000000 4.000000000000000 -0.050000000000000) // 18
  (0.707106781186548 4.000000000000000 -0.050000000000000) // 19
  (0.000000000000000 4.000000000000000 -0.050000000000000) // 20
  (-0.707106781186547 4.000000000000000 -0.050000000000000) // 21
  (-4.000000000000000 4.000000000000000 -0.050000000000000) // 22
  (-4.000000000000000 0.707106781186548 -0.050000000000000) // 23
  (-4.000000000000000 0.000000000000000 -0.050000000000000) // 24
  (-4.000000000000000 -0.707106781186547 -0.050000000000000) // 25
  (-4.000000000000000 -4.000000000000000 -0.050000000000000) // 26
  (-0.707106781186548 -4.000000000000000 -0.050000000000000) // 27
  (0.000000000000000 -4.000000000000000 -0.050000000000000) // 28
  (0.707106781186547 -4.000000000000000 -0.050000000000000) // 29
  (6.000000000000000 -4.000000000000000 -0.050000000000000) // 30
  (6.000000000000000 -0.707106781186548 -0.050000000000000) // 31
  (0.500000000000000 0.000000000000000 0.050000000000000) // 32
  (0.353553390593274 0.353553390593274 0.050000000000000) // 33
  (0.000000000000000 0.500000000000000 0.050000000000000) // 34
  (-0.353553390593274 0.353553390593274 0.050000000000000) // 35
  (-0.500000000000000 0.000000000000000 0.050000000000000) // 36
  (-0.353553390593274 -0.353553390593274 0.050000000000000) // 37
  (0.000000000000000 -0.500000000000000 0.050000000000000) // 38
  (0.353553390593274 -0.353553390593274 0.050000000000000) // 39
  (1.000000000000000 0.000000000000000 0.050000000000000) // 40
  (0.707106781186548 0.707106781186547 0.050000000000000) // 41
  (0.000000000000000 1.000000000000000 0.050000000000000) // 42
  (-0.707106781186547 0.707106781186548 0.050000000000000) // 43
  (-1.000000000000000 0.000000000000000 0.050000000000000) // 44
  (-0.707106781186548 -0.707106781186547 0.050000000000000) // 45
  (0.000000000000000 -1.000000000000000 0.050000000000000) // 46
  (0.707106781186547 -0.707106781186548 0.050000000000000) // 47
  (6.000000000000000 0.000000000000000 0.050000000000000) // 48
  (6.000000000000000 0.707106781186547 0.050000000000000) // 49
  (6.000000000000000 4.000000000000000 0.050000000000000) // 50
  (0.707106781186548 4.000000000000000 0.050000000000000) // 51
  (0.000000000000000 4.000000000000000 0.050000000000000) // 52
  (-0.707106781186547 4.000000000000000 0.050000000000000) // 53
  (-4.000000000000000 4.000000000000000 0.050000000000000) // 54
  (-4.000000000000000 0.707106781186548 0.050000000000000) // 55
  (-4.000000000000000 0.000000000000000 0.050000000000000) // 56
  (-4.000000000000000 -0.707106781186547 0.050000000000000) // 57
  (-4.000000000000000 -4.000000000000000 0.050000000000000) // 58
  (-0.707106781186548 -4.000000000000000 0.050000000000000) // 59
  (0.000000000000000 -4.000000000000000 0.050000000000000) // 60
  (0.707106781186547 -4.000000000000000 0.050000000000000) // 61
  (6.000000000000000 -4.000000000000000 0.050000000000000) // 62
  (6.000000000000000 -0.707106781186548 0.050000000000000) // 63
);

blocks
(
  hex (0 8 9 1 32 40 41 33) (10 20 1) simpleGrading (2.000000 1.000000 1.000000) // 0

  hex (1 9 10 2 33 41 42 34) (10 20 1) simpleGrading (2.000000 1.000000 1.000000) // 1

  hex (2 10 11 3 34 42 43 35) (10 20 1) simpleGrading (2.000000 1.000000 1.000000) // 2

  hex (3 11 12 4 35 43 44 36) (10 20 1) simpleGrading (2.000000 1.000000 1.000000) // 3

  hex (4 12 13 5 36 44 45 37) (10 20 1) simpleGrading (2.000000 1.000000 1.000000) // 4

  hex (5 13 14 6 37 45 46 38) (10 20 1) simpleGrading (2.000000 1.000000 1.000000) // 5

  hex (6 14 15 7 38 46 47 39) (10 20 1) simpleGrading (2.000000 1.000000 1.000000) // 6

  hex (7 15 8 0 39 47 40 32) (10 20 1) simpleGrading (2.000000 1.000000 1.000000) // 7

  hex (8 16 17 9 40 48 49 41) (30 20 1) simpleGrading (4.000000 1.000000 1.000000) // 8

  hex (9 17 18 19 41 49 50 51) (30 30 1) simpleGrading (4.000000 4.000000 1.000000) // 9

  hex (10 9 19 20 42 41 51 52) (20 30 1) simpleGrading (1.000000 4.000000 1.000000) // 10

  hex (11 10 20 21 43 42 52 53) (20 30 1) simpleGrading (1.000000 4.000000 1.000000) // 11

  hex (23 11 21 22 55 43 53 54) (15 30 1) simpleGrading (0.250000 4.000000 1.000000) // 12

  hex (24 12 11 23 56 44 43 55) (15 20 1) simpleGrading (0.250000 1.000000 1.000000) // 13

  hex (25 13 12 24 57 45 44 56) (15 20 1) simpleGrading (0.250000 1.000000 1.000000) // 14

  hex (26 27 13 25 58 59 45 57) (15 30 1) simpleGrading (0.250000 0.250000 1.000000) // 15

  hex (27 28 14 13 59 60 46 45) (20 30 1) simpleGrading (1.000000 0.250000 1.000000) // 16

  hex (28 29 15 14 60 61 47 46) (20 30 1) simpleGrading (1.000000 0.250000 1.000000) // 17

  hex (29 30 31 15 61 62 63 47) (30 30 1) simpleGrading (4.000000 0.250000 1.000000) // 18

  hex (15 31 16 8 47 63 48 40) (30 20 1) simpleGrading (4.000000 1.000000 1.000000) // 19

);

edges
(
arc 0 1 (0.461939766255643 0.191341716182545 -0.05)
arc 8 9 (0.923879532511287 0.382683432365090 -0.05)
arc 32 33 (0.461939766255643 0.191341716182545 0.05)
arc 40 41 (0.923879532511287 0.382683432365090 0.05)
arc 1 2 (0.191341716182545 0.461939766255643 -0.05)
arc 9 10 (0.382683432365090 0.923879532511287 -0.05)
arc 33 34 (0.191341716182545 0.461939766255643 0.05)
arc 41 42 (0.382683432365090 0.923879532511287 0.05)
arc 2 3 (-0.191341716182545 0.461939766255643 -0.05)
arc 10 11 (-0.382683432365090 0.923879532511287 -0.05)
arc 34 35 (-0.191341716182545 0.461939766255643 0.05)
arc 42 43 (-0.382683432365090 0.923879532511287 0.05)
arc 3 4 (-0.461939766255643 0.191341716182545 -0.05)
arc 11 12 (-0.923879532511287 0.382683432365090 -0.05)
arc 35 36 (-0.461939766255643 0.191341716182545 0.05)
arc 43 44 (-0.923879532511287 0.382683432365090 0.05)
arc 4 5 (-0.461939766255643 -0.191341716182545 -0.05)
arc 12 13 (-0.923879532511287 -0.382683432365090 -0.05)
arc 36 37 (-0.461939766255643 -0.191341716182545 0.05)
arc 44 45 (-0.923879532511287 -0.382683432365090 0.05)
arc 5 6 (-0.191341716182545 -0.461939766255643 -0.05)
arc 13 14 (-0.382683432365090 -0.923879532511287 -0.05)
arc 37 38 (-0.191341716182545 -0.461939766255643 0.05)
arc 45 46 (-0.382683432365090 -0.923879532511287 0.05)
arc 6 7 (0.191341716182545 -0.461939766255643 -0.05)
arc 14 15 (0.382683432365090 -0.923879532511287 -0.05)
arc 38 39 (0.191341716182545 -0.461939766255643 0.05)
arc 46 47 (0.382683432365090 -0.923879532511287 0.05)
arc 7 0 (0.461939766255643 -0.191341716182545 -0.05)
arc 15 8 (0.923879532511287 -0.382683432365090 -0.05)
arc 39 32 (0.461939766255643 -0.191341716182545 0.05)
arc 47 40 (0.923879532511287 -0.382683432365090 0.05)
);

boundary
(

  inlet
  {
      type patch;
      faces
      (
         (22 54 55 23)
         (23 55 56 24)
         (24 56 57 25)
         (25 57 58 26)
      );
  }

  outlet
  {
      type patch;
      faces
      (
         (18 50 49 17)
         (17 49 48 16)
         (16 48 63 31)
         (31 63 62 30)
      );
  }

  cylinder
  {
      type wall;
      faces
      (
         (0 32 33 1)
         (1 33 34 2)
         (2 34 35 3)
         (3 35 36 4)
         (4 36 37 5)
         (5 37 38 6)
         (6 38 39 7)
         (7 39 32 0)
      );
  }

  top
  {
      type symmetryPlane;
      faces
      (
         (22 54 53 21)
         (21 53 52 20)
         (20 52 51 19)
         (19 51 50 18)
      );
  }

  bottom
  {
      type symmetryPlane;
      faces
      (
         (26 58 59 27)
         (27 59 60 28)
         (28 60 61 29)
         (29 61 62 30)
      );
  }

);
